tema5/Artillery/artillery_ejem7/ejem7A.yml
config:
    target: "https://127.0.0.1:8443/api"
    tls:
      rejectUnauthorized: false
    phases:
      - duration: 1
        arrivalRate: 1
    payload:
      - path: "books.csv"
        fields:
          - "title"
          - "description"
        order: "sequence"
    variables:
        username:
          - "user"
          - "admin"
        password:
          - "pass"
scenarios:
    - flow:
        - get: 
            url: "/auth/logIn"
            auth:
              user: "{{ username }}"
              pass: "{{ password }}"
        - post:
            url: "/books/"
            json:
              title: "{{ title }}"
              description: "{{ description }}" 
            capture: 
              json: "$.id"
              as: "id"
        - get:
            url: "/books/{{ id }}"            
        - delete:
            url: "/books/{{ id }}"
            ifTrue: "username == \"admin\""